"""
Выведите список файлов в указанной директории.
"""
import os
print(os.listdir('C:/'))

