"""
Напишите код, который переводит целое число в строку, при том что его можно применить в любой системе счисления.
"""

my_string = str(1234)
print(my_string[1])